xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_SPI.cpp
#ifdef ESP32_PLATFORM

#include <ESP32Driver/Esp32Driver.h>

#if ESP32_SPI_ENABLED

#include <driver/spi_master.h>

#include <unordered_map>
#include <vector>

#include "BuildinStdlib.h"
#include "GC.h"
#include "VM.h"

#pragma region spi_support

#define SPI_MASTER_TIMEOUT_MS 1000

// SPI传输模式 - 添加NEXUS_前缀避免命名冲突
enum NEXUS_SPIMode {
  NEXUS_SPI_MODE_0 = 0,  // CPOL=0, CPHA=0
  NEXUS_SPI_MODE_1,      // CPOL=0, CPHA=1
  NEXUS_SPI_MODE_2,      // CPOL=1, CPHA=0
  NEXUS_SPI_MODE_3       // CPOL=1, CPHA=1
};

// SPI位序 - 添加NEXUS_前缀避免命名冲突
enum NEXUS_SPIBitOrder { NEXUS_SPI_MSBFIRST = 0, NEXUS_SPI_LSBFIRST };

// 存储SPI实例
struct SPIInstance {
  spi_device_handle_t device_handle;
  spi_host_device_t host;
  int cs_pin;
  int mosi_pin;
  int miso_pin;
  int sclk_pin;
  int mode;
  int clock_speed;
  int bit_order;
  int data_bits;
};

static std::unordered_map<uint32_t, SPIInstance> spiInstances;
static uint32_t spiInstanceIdSeed = 1;

// 将模式转换为ESP32 SPI模式 - 不再定义spi_mode_t，直接使用int
int get_nexus_spi_mode(int mode) {
  // 将我们的模式转换为ESP-IDF的spi_mode_t
  switch (mode) {
    case NEXUS_SPI_MODE_0:
      return 0;  // SPI_MODE0
    case NEXUS_SPI_MODE_1:
      return 1;  // SPI_MODE1
    case NEXUS_SPI_MODE_2:
      return 2;  // SPI_MODE2
    case NEXUS_SPI_MODE_3:
      return 3;  // SPI_MODE3
    default:
      return 0;
  }
}

// 获取SPI主机设备
spi_host_device_t get_spi_host(int bus_num) {
  switch (bus_num) {
    case 1:
      return SPI2_HOST;  // HSPI对应SPI2_HOST
    case 2:
      return SPI3_HOST;  // VSPI对应SPI3_HOST
    default:
      return SPI2_HOST;  // 默认为HSPI
  }
}

// 获取SPI引脚配置
void get_spi_pins(spi_host_device_t host, int* mosi, int* miso, int* sclk) {
  switch (host) {
    case SPI2_HOST:          // HSPI
      if (mosi) *mosi = 13;  // HSPI MOSI
      if (miso) *miso = 12;  // HSPI MISO
      if (sclk) *sclk = 14;  // HSPI SCLK
      break;
    case SPI3_HOST:          // VSPI
      if (mosi) *mosi = 23;  // VSPI MOSI
      if (miso) *miso = 19;  // VSPI MISO
      if (sclk) *sclk = 18;  // VSPI SCLK
      break;
    default:
      if (mosi) *mosi = 13;
      if (miso) *miso = 12;
      if (sclk) *sclk = 14;
  }
}
// SPI传输函数 - 修复版本
esp_err_t spi_master_transmit(spi_device_handle_t handle,
                              const uint8_t* tx_data, uint8_t* rx_data,
                              size_t tx_length, size_t rx_length) {
  if (rx_length == 0 && tx_length == 0) {
    return ESP_OK;
  }

  spi_transaction_t trans = {};

  if (tx_length > 0) {
    trans.length = tx_length * 8;  // 总位数
    trans.tx_buffer = tx_data;
  }

  if (rx_length > 0) {
    trans.rxlength = rx_length * 8;  // 接收位数
    trans.rx_buffer = rx_data;
  } else {
    trans.rxlength = 0;
    trans.rx_buffer = nullptr;
  }

  trans.flags = 0;

  return spi_device_transmit(handle, &trans);
}

// 释放SPI设备
esp_err_t spi_master_delete(spi_device_handle_t handle) {
  return spi_bus_remove_device(handle);
}

std::unordered_map<std::string, VariableValue> SPIObjectFuncTemplate;

void SPIObjectFuncTemplateInit() {
  // 析构函数
  SPIObjectFuncTemplate["finalize"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (spiInstances.find(instanceId) != spiInstances.end()) {
          spi_master_delete(spiInstances[instanceId].device_handle);
          spi_bus_free(spiInstances[instanceId].host);
          spiInstances.erase(instanceId);
        }

        return CreateBooleanVariable(true);
      });

  // 传输数据（全双工）
  SPIObjectFuncTemplate["transfer"] = VM::CreateSystemFunc(
      2,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (spiInstances.find(instanceId) == spiInstances.end()) {
          currentWorker->ThrowError(
              "SPI instance not initialized or already released");
          return VariableValue();
        }

        SPIInstance& spi_inst = spiInstances[instanceId];

        if (args[0].getContentType() != ValueType::OBJECT ||
            args[1].getContentType() != ValueType::OBJECT) {
        }

        ByteBufferInfo txBuffer;
        ByteBufferInfo rxBuffer;
        auto& obj = args[0].content.ref->implement.objectImpl;
        if (obj.find("bufid") != obj.end()) {
          // Buffer对象
          uint32_t bufid = obj["bufid"].content.number;
          txBuffer = GetByteBufferInfo(bufid);
          if (!txBuffer.data) {
            currentWorker->ThrowError("invalid buffer");
            return VariableValue();
          }
        }
        obj = args[1].content.ref->implement.objectImpl;
        if (obj.find("bufid") != obj.end()) {
          // Buffer对象
          uint32_t bufid = obj["bufid"].content.number;
          rxBuffer = GetByteBufferInfo(bufid);
          if (!rxBuffer.data) {
            currentWorker->ThrowError("invalid buffer");
            return VariableValue();
          }
        }

        // 执行SPI传输
        esp_err_t ret = spi_master_transmit(spi_inst.device_handle,
                                            txBuffer.data, rxBuffer.data,
                                            txBuffer.length, rxBuffer.length);

        if (ret != ESP_OK) {
          char error_msg[100];
          snprintf(error_msg, sizeof(error_msg), "SPI transfer failed: %d",
                   ret);
          return CreateBooleanVariable(false);
        }

        return CreateBooleanVariable(true);
      });

      /*
  // 只发送数据  write(payload : number | Buffer)
  SPIObjectFuncTemplate["write"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

