xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_SPI.cpp
        if (spiInstances.find(instanceId) == spiInstances.end()) {
          currentWorker->ThrowError(
              "SPI instance not initialized or already released");
          return VariableValue();
        }

        SPIInstance& spi_inst = spiInstances[instanceId];
        std::vector<uint8_t> tx_data;

        // 处理发送数据
        if (args[0].getContentType() == ValueType::NUM) {
          // 单个字节
          tx_data.push_back((uint8_t)args[0].content.number);
        } else if (args[0].getContentType() == ValueType::OBJECT) {
          auto& obj = args[0].content.ref->implement.objectImpl;
          if (obj.find("bufid") != obj.end()) {
            // Buffer对象
            uint32_t bufid = obj["bufid"].content.number;
            auto bufinfo = GetByteBufferInfo(bufid);
            if (!bufinfo.data || bufinfo.length == 0) {
              currentWorker->ThrowError("Invalid Buffer");
              return VariableValue();
            }

            // 执行SPI发送
            esp_err_t ret =
                spi_master_transmit(spi_inst.device_handle, bufinfo.data,
                                    nullptr, bufinfo.length, 0);
            if (ret != ESP_OK) printf("SPI write failed: %d", ret);
            return CreateBooleanVariable(ret == ESP_OK);
          } else {
            currentWorker->ThrowError(
                "Data argument must be a number or Buffer");
            return VariableValue();
          }
        } else {
          currentWorker->ThrowError("Data argument must be a number or Buffer");
          return VariableValue();
        }

        if (tx_data.empty()) {
          currentWorker->ThrowError("No data to write");
          return VariableValue();
        }

        // 执行SPI发送
        esp_err_t ret = spi_master_transmit(
            spi_inst.device_handle, tx_data.data(), nullptr, tx_data.size(), 0);

        if (ret != ESP_OK) {
          printf("SPI write failed: %d", ret);

          return CreateBooleanVariable(false);
        }
        return CreateBooleanVariable(ret == ESP_OK);
      });

      */

  SPIObjectFuncTemplate["write"] = VM::CreateSystemFunc(
    DYNAMIC_ARGUMENT,
    [](std::vector<VariableValue>& args, VMObject* thisValue,
       VMWorker* currentWorker) -> VariableValue {
        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (spiInstances.find(instanceId) == spiInstances.end()) {
            currentWorker->ThrowError(
                "SPI instance not initialized or already released");
            return VariableValue();
        }

        if(args.size() <= 0){
          currentWorker->ThrowError(
                "argument.count must > 1");
          return VariableValue();
        }

        SPIInstance& spi_inst = spiInstances[instanceId];
        const uint8_t* tx_data = nullptr;
        size_t data_len = 0;
        uint8_t single_byte = 0;
        bool is_single_byte = false;
        
        // 处理第一个参数
        if (args[0].getContentType() == ValueType::NUM) {
            // 单个字节
            single_byte = (uint8_t)args[0].content.number;
            tx_data = &single_byte;
            data_len = 1;
            is_single_byte = true;
        } 
        else if (args[0].getContentType() == ValueType::OBJECT) {
            auto& obj = args[0].content.ref->implement.objectImpl;
            if (obj.find("bufid") == obj.end()) {
                currentWorker->ThrowError("Data must be a number or Buffer");
                return VariableValue();
            }
            
            uint32_t bufid = obj["bufid"].content.number;
            auto bufinfo = GetByteBufferInfo(bufid);
            
            if (!bufinfo.data || bufinfo.length == 0) {
                currentWorker->ThrowError("Invalid Buffer");
                return VariableValue();
            }
            
            size_t offset = 0;
            size_t length = bufinfo.length;
            
            // 处理offset参数
            if (args.size() >= 2) {
                if (args[1].getContentType() != ValueType::NUM) {
                    currentWorker->ThrowError("Offset must be a number");
                    return VariableValue();
                }
                offset = (size_t)args[1].content.number;
                if (offset >= bufinfo.length) {
                    currentWorker->ThrowError("Offset out of range");
                    return VariableValue();
                }
            }
            
            // 处理length参数
            if (args.size() >= 3) {
                if (args[2].getContentType() != ValueType::NUM) {
                    currentWorker->ThrowError("Length must be a number");
                    return VariableValue();
                }
                length = (size_t)args[2].content.number;
                if (length == 0) {
                    length = bufinfo.length - offset;
                }
                if (offset + length > bufinfo.length) {
                    currentWorker->ThrowError("Length out of range");
                    return VariableValue();
                }
            } else {
                length = bufinfo.length - offset;
            }
            
            tx_data = bufinfo.data + offset;
            data_len = length;
        } else {
            currentWorker->ThrowError("Data must be a number or Buffer");
            return VariableValue();
        }
        
        if (data_len == 0) {
            return CreateBooleanVariable(true);
        }
        
        esp_err_t ret = ESP_OK;
        
        // 如果是单个字节或小数据，直接传输
        if (data_len <= 4096) {
            ret = spi_master_transmit(spi_inst.device_handle, tx_data, nullptr, data_len, 0);
        } 
        // 大数据分块传输
        else {
            const size_t CHUNK_SIZE = 4096;
            for (size_t offset = 0; offset < data_len; offset += CHUNK_SIZE) {
                size_t chunk_len = (data_len - offset) > CHUNK_SIZE ? 
                                   CHUNK_SIZE : (data_len - offset);
                
