xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_SPI.cpp
                ret = spi_master_transmit(spi_inst.device_handle, 
                                         tx_data + offset, 
                                         nullptr, 
                                         chunk_len, 0);
                if (ret != ESP_OK) {
                    break;
                }
            }
        }
        
        if (ret != ESP_OK) {
            printf("SPI write failed: 0x%x\n", ret);
            return CreateBooleanVariable(false);
        }
        return CreateBooleanVariable(true);
    });

  // 只接收数据 read(buf : Buffer,length : number)
  SPIObjectFuncTemplate["read"] = VM::CreateSystemFunc(
      2,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::OBJECT ||
            args[1].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("Invalid argument");
          return VariableValue();
        }

        size_t length = (size_t)args[1].content.number;

        if (length <= 0 || length > 4096) {
          currentWorker->ThrowError("Read length must be between 1 and 4096");
          return VariableValue();
        }

        auto bufid_it = args[0].content.ref->implement.objectImpl.find("bufid");
        if (bufid_it == args[0].content.ref->implement.objectImpl.end()) {
          currentWorker->ThrowError("Invalid buffer object");
          return VariableValue();
        }
        uint32_t bufid = (uint32_t)(*bufid_it).second.content.number;

        auto buf_info = GetByteBufferInfo(bufid);

        if (!buf_info.data) {
          currentWorker->ThrowError("Invalid buffer object");
          return VariableValue();
        }

        if (buf_info.length < length) {
          currentWorker->ThrowError("the buffer size too low");
          return VariableValue();
        }

        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (spiInstances.find(instanceId) == spiInstances.end()) {
          currentWorker->ThrowError(
              "SPI instance not initialized or already released");
          return VariableValue();
        }

        SPIInstance& spi_inst = spiInstances[instanceId];

        // 准备接收缓冲区
        // std::vector<uint8_t> rx_data(length, 0);
        std::vector<uint8_t> tx_data(length, 0xFF);  // 发送全1以读取数据

        // 执行SPI传输
        esp_err_t ret =
            spi_master_transmit(spi_inst.device_handle, tx_data.data(),
                                buf_info.data, length, length);

        if (ret != ESP_OK) {
          printf("SPI read failed: %d", ret);
          return CreateBooleanVariable(false);
        }

        return CreateBooleanVariable(true);
      });

  // 传输16位数据
  SPIObjectFuncTemplate["transfer16"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("Invalid argument: expected 16-bit data");
          return VariableValue();
        }

        uint16_t tx_data = (uint16_t)args[0].content.number;
        uint16_t rx_data = 0;

        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (spiInstances.find(instanceId) == spiInstances.end()) {
          currentWorker->ThrowError(
              "SPI instance not initialized or already released");
          return VariableValue();
        }

        SPIInstance& spi_inst = spiInstances[instanceId];

        // 准备SPI事务
        spi_transaction_t trans = {};
        trans.length = 16;           // 16位数据
        trans.rxlength = 16;         // 接收16位
        trans.tx_buffer = &tx_data;  // 发送数据
        trans.rx_buffer = &rx_data;  // 接收数据

        // 执行传输
        esp_err_t ret = spi_device_transmit(spi_inst.device_handle, &trans);

        if (ret != ESP_OK) {
          printf("SPI failed: %d", ret);
          return CreateBooleanVariable(false);
        }

        return CreateNumberVariable(rx_data);
      });

  // 传输32位数据
  SPIObjectFuncTemplate["transfer32"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::NUM) {
          currentWorker->ThrowError("Invalid argument: expected 32-bit data");
          return VariableValue();
        }

        uint32_t tx_data = (uint32_t)args[0].content.number;
        uint32_t rx_data = 0;

        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (spiInstances.find(instanceId) == spiInstances.end()) {
          currentWorker->ThrowError(
              "SPI instance not initialized or already released");
          return VariableValue();
        }

        SPIInstance& spi_inst = spiInstances[instanceId];

        // 准备SPI事务
        spi_transaction_t trans = {};
        trans.length = 32;           // 32位数据
        trans.rxlength = 32;         // 接收32位
        trans.tx_buffer = &tx_data;  // 发送数据
        trans.rx_buffer = &rx_data;  // 接收数据

        // 执行传输
        esp_err_t ret = spi_device_transmit(spi_inst.device_handle, &trans);

        if (ret != ESP_OK) {
          printf("SPI failed: %d", ret);
          return CreateBooleanVariable(false);
        }

        return CreateNumberVariable((double)rx_data);
      });

  // 设置CS引脚状态
  SPIObjectFuncTemplate["setCS"] = VM::CreateSystemFunc(
      1,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::BOOL) {
          currentWorker->ThrowError("Invalid argument: expected boolean");
          return VariableValue();
        }

        bool cs_state = args[0].content.boolean;

