xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_SPI.cpp
        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (spiInstances.find(instanceId) == spiInstances.end()) {
          currentWorker->ThrowError(
              "SPI instance not initialized or already released");
          return VariableValue();
        }

        SPIInstance& spi_inst = spiInstances[instanceId];

        // 设置CS引脚状态
        gpio_set_direction((gpio_num_t)spi_inst.cs_pin, GPIO_MODE_OUTPUT);
        gpio_set_level((gpio_num_t)spi_inst.cs_pin, cs_state ? 0 : 1);

        return CreateBooleanVariable(true);
      });

  // 获取SPI配置信息
  SPIObjectFuncTemplate["getConfig"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (spiInstances.find(instanceId) == spiInstances.end()) {
          currentWorker->ThrowError(
              "SPI instance not initialized or already released");
          return VariableValue();
        }

        SPIInstance& spi_inst = spiInstances[instanceId];

        VMObject* configObj =
            currentWorker->VMInstance->currentGC->GC_NewObject(
                ValueType::OBJECT);
        auto& configContainer = configObj->implement.objectImpl;

        configContainer["bus"] =
            CreateNumberVariable(spi_inst.host == SPI2_HOST ? 1 : 2);
        configContainer["cs_pin"] = CreateNumberVariable(spi_inst.cs_pin);
        configContainer["clock_speed"] =
            CreateNumberVariable(spi_inst.clock_speed);
        configContainer["mode"] = CreateNumberVariable(spi_inst.mode);
        configContainer["bit_order"] = CreateNumberVariable(spi_inst.bit_order);
        configContainer["data_bits"] = CreateNumberVariable(spi_inst.data_bits);

        return CreateReferenceVariable(configObj);
      });

  // 释放资源
  SPIObjectFuncTemplate["close"] = VM::CreateSystemFunc(
      0,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        uint32_t instanceId =
            (uint32_t)thisValue->implement.objectImpl["_id"].content.number;

        if (spiInstances.find(instanceId) != spiInstances.end()) {
          spi_master_delete(spiInstances[instanceId].device_handle);
          spi_bus_free(spiInstances[instanceId].host);
          spiInstances.erase(instanceId);
        }

        return CreateBooleanVariable(true);
      });
}

void ESP32_SPI_Init(VM* VMInstance) {
  VMObject* spiClass = VMInstance->currentGC->GC_NewObject(ValueType::OBJECT);

  // 添加常量定义 - 使用NEXUS_前缀
  spiClass->implement.objectImpl["MODE_0"] =
      CreateNumberVariable(NEXUS_SPI_MODE_0);
  spiClass->implement.objectImpl["MODE_1"] =
      CreateNumberVariable(NEXUS_SPI_MODE_1);
  spiClass->implement.objectImpl["MODE_2"] =
      CreateNumberVariable(NEXUS_SPI_MODE_2);
  spiClass->implement.objectImpl["MODE_3"] =
      CreateNumberVariable(NEXUS_SPI_MODE_3);
  spiClass->implement.objectImpl["MSBFIRST"] =
      CreateNumberVariable(NEXUS_SPI_MSBFIRST);
  spiClass->implement.objectImpl["LSBFIRST"] =
      CreateNumberVariable(NEXUS_SPI_LSBFIRST);
  spiClass->implement.objectImpl["HSPI"] = CreateNumberVariable(1);  // HSPI总线
  spiClass->implement.objectImpl["VSPI"] = CreateNumberVariable(2);  // VSPI总线


  SPIObjectFuncTemplateInit();

  //初始化SPI主机 - 修改为支持两种调用方式
spiClass->implement.objectImpl["init"] = VM::CreateSystemFunc(
    DYNAMIC_ARGUMENT,
    [](std::vector<VariableValue>& args, VMObject* thisValue,
       VMWorker* currentWorker) -> VariableValue {
        int bus_num, cs_pin, clock_speed, mode, bit_order, data_bits;
        int mosi_pin = -1, miso_pin = -1, sclk_pin = -1;
        
        // 检查是否是对象参数（第一个参数是对象）
        if (args.size() == 1 && args[0].getContentType() == ValueType::REF && 
            args[0].content.ref != nullptr) {
            // 对象参数模式
            VMObject* configObj = args[0].content.ref;
            auto& config = configObj->implement.objectImpl;
            
            // 从对象中读取必需参数
            if (config.find("bus") == config.end() || config["bus"].getContentType() != ValueType::NUM ||
                config.find("cs") == config.end() || config["cs"].getContentType() != ValueType::NUM) {
                currentWorker->ThrowError("Object must contain 'bus' and 'cs' parameters");
                return VariableValue();
            }
            
            bus_num = (int)config["bus"].content.number;
            cs_pin = (int)config["cs"].content.number;
            
            // 读取可选参数
            clock_speed = config.find("clock_speed") != config.end() && 
                         config["clock_speed"].getContentType() == ValueType::NUM ?
                         (int)config["clock_speed"].content.number : 1000000;
            if (config.find("frequency") != config.end() && 
                config["frequency"].getContentType() == ValueType::NUM) {
                clock_speed = (int)config["frequency"].content.number;
            }
            
            mode = config.find("mode") != config.end() && 
                  config["mode"].getContentType() == ValueType::NUM ?
                  (int)config["mode"].content.number : 0;
            
            bit_order = config.find("bit_order") != config.end() && 
                       config["bit_order"].getContentType() == ValueType::NUM ?
                       (int)config["bit_order"].content.number : 0;
            
            data_bits = config.find("data_bits") != config.end() && 
                       config["data_bits"].getContentType() == ValueType::NUM ?
                       (int)config["data_bits"].content.number : 8;
            
            // 读取自定义引脚
            if (config.find("mosi") != config.end() && 
                config["mosi"].getContentType() == ValueType::NUM) {
                mosi_pin = (int)config["mosi"].content.number;
            }
            if (config.find("miso") != config.end() && 
                config["miso"].getContentType() == ValueType::NUM) {
                miso_pin = (int)config["miso"].content.number;
            }
            if (config.find("sclk") != config.end() && 
                config["sclk"].getContentType() == ValueType::NUM) {
                sclk_pin = (int)config["sclk"].content.number;
            }
        } else {
            // 原始6个参数模式
            if (args[0].getContentType() != ValueType::NUM ||  // bus_num
                args[1].getContentType() != ValueType::NUM ||  // cs_pin
                args[2].getContentType() != ValueType::NUM ||  // clock_speed
                args[3].getContentType() != ValueType::NUM ||  // mode
                args[4].getContentType() != ValueType::NUM ||  // bit_order
                args[5].getContentType() != ValueType::NUM) {  // data_bits
                currentWorker->ThrowError(
                    "Invalid argument type: expected (bus_num, cs_pin, clock_speed, "
                    "mode, bit_order, data_bits) or config object");
                return VariableValue();
            }
            
            bus_num = (int)args[0].content.number;
            cs_pin = (int)args[1].content.number;
            clock_speed = (int)args[2].content.number;
            mode = (int)args[3].content.number;
            bit_order = (int)args[4].content.number;
            data_bits = (int)args[5].content.number;
        }

