xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_SPI.cpp
        // 验证参数范围（保持原样）
        if (bus_num != 1 && bus_num != 2) {
            currentWorker->ThrowError("Bus number must be 1 (HSPI) or 2 (VSPI)");
            return VariableValue();
        }

        if (clock_speed < 100000 || clock_speed > 80000000) {
            currentWorker->ThrowError(
                "Clock speed must be between 100KHz and 80MHz");
            return VariableValue();
        }

        if (mode < NEXUS_SPI_MODE_0 || mode > NEXUS_SPI_MODE_3) {
            currentWorker->ThrowError("Mode must be between 0 and 3");
            return VariableValue();
        }

        if (data_bits != 8 && data_bits != 16 && data_bits != 32) {
            currentWorker->ThrowError("Data bits must be 8, 16, or 32");
            return VariableValue();
        }

        // 创建SPI对象
        VMObject* spiObject =
            currentWorker->VMInstance->currentGC->GC_NewObject(
                ValueType::OBJECT);

        spiObject->implement.objectImpl =
            SPIObjectFuncTemplate;  // 拷贝对象模板过去

        auto& objContainer = spiObject->implement.objectImpl;

        // 分配实例ID
        uint32_t instanceId = spiInstanceIdSeed++;
        objContainer["_id"] = CreateNumberVariable((double)instanceId);
        objContainer["bus"] = CreateNumberVariable(bus_num);
        objContainer["cs"] = CreateNumberVariable(cs_pin);
        objContainer["clock"] = CreateNumberVariable(clock_speed);
        objContainer["mode"] = CreateNumberVariable(mode);
        objContainer["bit_order"] = CreateNumberVariable(bit_order);
        objContainer["data_bits"] = CreateNumberVariable(data_bits);

        // 获取SPI主机
        spi_host_device_t host = get_spi_host(bus_num);
        
        // 获取引脚：优先使用自定义，否则用默认
        int default_mosi, default_miso, default_sclk;
        get_spi_pins(host, &default_mosi, &default_miso, &default_sclk);
        
        if (mosi_pin == -1) mosi_pin = default_mosi;
        if (miso_pin == -1) miso_pin = default_miso;
        if (sclk_pin == -1) sclk_pin = default_sclk;
        
        // 保存引脚到对象
        objContainer["mosi"] = CreateNumberVariable(mosi_pin);
        objContainer["miso"] = CreateNumberVariable(miso_pin);
        objContainer["sclk"] = CreateNumberVariable(sclk_pin);

        // 初始化SPI总线配置
        spi_bus_config_t bus_config = {};
        bus_config.mosi_io_num = mosi_pin;
        bus_config.miso_io_num = miso_pin;
        bus_config.sclk_io_num = sclk_pin;
        bus_config.quadwp_io_num = -1;
        bus_config.quadhd_io_num = -1;
        bus_config.max_transfer_sz = 4096;

        // 初始化设备配置
        spi_device_interface_config_t dev_config = {};
        dev_config.mode = get_nexus_spi_mode(mode);
        dev_config.clock_speed_hz = clock_speed;
        dev_config.spics_io_num = cs_pin;
        dev_config.queue_size = 7;

        // 设置位序标志
        if (bit_order == NEXUS_SPI_LSBFIRST) {
            dev_config.flags =
                SPI_DEVICE_TXBIT_LSBFIRST | SPI_DEVICE_RXBIT_LSBFIRST;
        }

        // 初始化SPI总线
        esp_err_t ret = spi_bus_initialize(host, &bus_config, SPI_DMA_CH_AUTO);
        if (ret != ESP_OK) {
            char error_msg[100];
            snprintf(error_msg, sizeof(error_msg),
                    "Failed to initialize SPI bus: %d", ret);
            currentWorker->ThrowError(
                std::string(error_msg, error_msg + strlen(error_msg)));
            return VariableValue();
        }

        // 添加设备到总线
        spi_device_handle_t device_handle;
        ret = spi_bus_add_device(host, &dev_config, &device_handle);
        if (ret != ESP_OK) {
            spi_bus_free(host);
            char error_msg[100];
            snprintf(error_msg, sizeof(error_msg), "Failed to add SPI device: %d",
                    ret);
            currentWorker->ThrowError(
                std::string(error_msg, error_msg + strlen(error_msg)));
            return VariableValue();
        }

        // 存储SPI实例
        SPIInstance spi_inst = {.device_handle = device_handle,
                                .host = host,
                                .cs_pin = cs_pin,
                                .mosi_pin = mosi_pin,
                                .miso_pin = miso_pin,
                                .sclk_pin = sclk_pin,
                                .mode = mode,
                                .clock_speed = clock_speed,
                                .bit_order = bit_order,
                                .data_bits = data_bits};
        spiInstances[instanceId] = spi_inst;

        return CreateReferenceVariable(spiObject);
    });

  /*
  // 初始化SPI主机
  spiClass->implement.objectImpl["init"] = VM::CreateSystemFunc(
      6,
      [](std::vector<VariableValue>& args, VMObject* thisValue,
         VMWorker* currentWorker) -> VariableValue {
        if (args[0].getContentType() != ValueType::NUM ||  // bus_num
            args[1].getContentType() != ValueType::NUM ||  // cs_pin
            args[2].getContentType() != ValueType::NUM ||  // clock_speed
            args[3].getContentType() != ValueType::NUM ||  // mode
            args[4].getContentType() != ValueType::NUM ||  // bit_order
            args[5].getContentType() != ValueType::NUM) {  // data_bits
          currentWorker->ThrowError(
              "Invalid argument type: expected (bus_num, cs_pin, clock_speed, "
              "mode, bit_order, data_bits)");
          return VariableValue();
        }

        int bus_num = (int)args[0].content.number;
        int cs_pin = (int)args[1].content.number;
        int clock_speed = (int)args[2].content.number;
        int mode = (int)args[3].content.number;
        int bit_order = (int)args[4].content.number;
        int data_bits = (int)args[5].content.number;

        // 验证参数范围
        if (bus_num != 1 && bus_num != 2) {
          currentWorker->ThrowError("Bus number must be 1 (HSPI) or 2 (VSPI)");
          return VariableValue();
        }

        if (clock_speed < 100000 || clock_speed > 40000000) {
          currentWorker->ThrowError(
              "Clock speed must be between 100KHz and 40MHz");
          return VariableValue();
        }

