xy660/NexusEJS/src/NexusEJS-Firmware/src/ESP32Driver/ESP32_Driver_SPI.cpp
        if (mode < NEXUS_SPI_MODE_0 || mode > NEXUS_SPI_MODE_3) {
          currentWorker->ThrowError("Mode must be between 0 and 3");
          return VariableValue();
        }

        if (data_bits != 8 && data_bits != 16 && data_bits != 32) {
          currentWorker->ThrowError("Data bits must be 8, 16, or 32");
          return VariableValue();
        }

        // 创建SPI对象
        VMObject* spiObject =
            currentWorker->VMInstance->currentGC->GC_NewObject(
                ValueType::OBJECT);

        spiObject->implement.objectImpl =
            SPIObjectFuncTemplate;  // 拷贝对象模板过去

        auto& objContainer = spiObject->implement.objectImpl;

        // 分配实例ID
        uint32_t instanceId = spiInstanceIdSeed++;
        objContainer["_id"] = CreateNumberVariable((double)instanceId);
        objContainer["bus"] = CreateNumberVariable(bus_num);
        objContainer["cs"] = CreateNumberVariable(cs_pin);
        objContainer["clock"] = CreateNumberVariable(clock_speed);
        objContainer["mode"] = CreateNumberVariable(mode);
        objContainer["bit_order"] = CreateNumberVariable(bit_order);
        objContainer["data_bits"] = CreateNumberVariable(data_bits);

        // 获取SPI主机和引脚
        spi_host_device_t host = get_spi_host(bus_num);
        int mosi_pin, miso_pin, sclk_pin;
        get_spi_pins(host, &mosi_pin, &miso_pin, &sclk_pin);

        // 初始化SPI总线配置
        spi_bus_config_t bus_config = {};
        bus_config.mosi_io_num = mosi_pin;
        bus_config.miso_io_num = miso_pin;
        bus_config.sclk_io_num = sclk_pin;
        bus_config.quadwp_io_num = -1;
        bus_config.quadhd_io_num = -1;
        bus_config.max_transfer_sz = 4096;

        // 初始化设备配置
        spi_device_interface_config_t dev_config = {};
        dev_config.mode = get_nexus_spi_mode(mode);
        dev_config.clock_speed_hz = clock_speed;
        dev_config.spics_io_num = cs_pin;
        dev_config.queue_size = 7;

        // 设置位序标志
        if (bit_order == NEXUS_SPI_LSBFIRST) {
          dev_config.flags =
              SPI_DEVICE_TXBIT_LSBFIRST | SPI_DEVICE_RXBIT_LSBFIRST;
        }

        // 初始化SPI总线
        esp_err_t ret = spi_bus_initialize(host, &bus_config, SPI_DMA_CH_AUTO);
        if (ret != ESP_OK) {
          char error_msg[100];
          snprintf(error_msg, sizeof(error_msg),
                   "Failed to initialize SPI bus: %d", ret);
          currentWorker->ThrowError(
              std::string(error_msg, error_msg + strlen(error_msg)));
          return VariableValue();
        }

        // 添加设备到总线
        spi_device_handle_t device_handle;
        ret = spi_bus_add_device(host, &dev_config, &device_handle);
        if (ret != ESP_OK) {
          spi_bus_free(host);
          char error_msg[100];
          snprintf(error_msg, sizeof(error_msg), "Failed to add SPI device: %d",
                   ret);
          currentWorker->ThrowError(
              std::string(error_msg, error_msg + strlen(error_msg)));
          return VariableValue();
        }

        // 存储SPI实例
        SPIInstance spi_inst = {.device_handle = device_handle,
                                .host = host,
                                .cs_pin = cs_pin,
                                .mode = mode,
                                .clock_speed = clock_speed,
                                .bit_order = bit_order,
                                .data_bits = data_bits};
        spiInstances[instanceId] = spi_inst;

        return CreateReferenceVariable(spiObject);
      });

      */

  std::string spiClassName = "SPI";
  auto spiClassRef = CreateReferenceVariable(spiClass);
  VMInstance->storeGlobalSymbol(spiClassName, spiClassRef);
}

#pragma endregion

#endif

#endif